//=================================================================================================
//
//	Sivキーボード
//		入力記録を毎フレームで記録し、押されている状態かどうかを取得する
//		キー定数はKeyDefine.hにて定義
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "Define.h"
#include "SivInputDefine.h"

//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	class SivKeyboard
	{
		//キーボードの状態保存
		Array < bool >	ma_keyState { F };
		Array < bool >	ma_preKeyState { F };

	public:
		SivKeyboard ();
		SivKeyboard ( const SivKeyboard & rhs ) = delete;
		~SivKeyboard ();

		//指定したキーが押されているか
		bool IsKey( int nKey );
		//指定したキーが押された瞬間か
		bool PushKey( int nKey );
		//指定したキーが離された瞬間か
		bool ReleaseKey( int nKey );

		//ゲーム利用
		//状態の更新
		//メインオブジェクトから取得
		void Update ( Array < Input > & keys );
	};
}
