//-------------------------------------------------------------------------------------------------
// Atlas 定義
//-------------------------------------------------------------------------------------------------
#pragma once


//-------------------------------------------------------------------------------------------------
// ヘッダファイル
//-------------------------------------------------------------------------------------------------
#include <cstdint>


//-------------------------------------------------------------------------------------------------
//基本データ
using PIXEL = uint32_t;

//-------------------------------------------------------------------------------------------------
//Tip サイズ
//constexpr uint32_t TIP_W = 64;
//constexpr uint32_t TIP_H = 64;
constexpr uint32_t TIP_W = 32;
constexpr uint32_t TIP_H = 32;
constexpr size_t TIP_N = TIP_W * TIP_H;


//-------------------------------------------------------------------------------------------------
//Atlas ビット　サイズ
constexpr uint32_t ATLAS_X = 4096;
constexpr uint32_t ATLAS_Y = 4096;
constexpr uint32_t ATLAS_SIZE = ATLAS_X * ATLAS_Y;

//Tip個数
constexpr uint32_t ATLAS_TIP_X = ATLAS_X / TIP_W;
constexpr uint32_t ATLAS_TIP_Y = ATLAS_Y / TIP_H;
constexpr uint32_t ATLAS_TIP_N = ATLAS_TIP_X * ATLAS_TIP_Y;

