//=================================================================================================
//
// ゲームシーン ソースファイル
//		遷移時にデータの破棄をする状態遷移
//
//=================================================================================================

//-------------------------------------------------------------------------------------------------
// ヘッダのインクルード
//-------------------------------------------------------------------------------------------------
#include "GameScene.h"


//-------------------------------------------------------------------------------------------------
// 定義
//-------------------------------------------------------------------------------------------------
namespace GAME
{

	//------------------------------------------------------------------
	//	ゲームシーン
	//------------------------------------------------------------------
	//ヘッダのみ


	//------------------------------------------------------------------
	//	ゲームシーンマネージャ
	//------------------------------------------------------------------
	GameSceneManager::GameSceneManager ()
	{
	}

	GameSceneManager::~GameSceneManager ()
	{
	}

	//フレーム毎動作と遷移チェック
	void GameSceneManager::Move ()
	{
		Transit ();	//遷移条件確認
		GameTaskVector::Move ();
	}

	void GameSceneManager::Transit ()
	{
		//Transit()内で指定した遷移先、またはthisが返る
		P_GameScene next = m_pScene->Transit ();

		if ( next != m_pScene )	//以前と異なる場合
		{
//			TRACE_F ( _T ( "m_pScene = %x, next = %x\n" ), m_pScene, next );

			//パラメータの移譲
			next->SetpParam ( m_pScene->GetpParam () );

			//明示的解放
			EraseTask ( m_pScene );
			m_pScene.reset ();

			//新規シーンを設定
			m_pScene = next;
			AddpTask ( m_pScene );

			//各初期化
			m_pScene->ParamInit ();
			m_pScene->Load ();
			m_pScene->Init ();

			//一時変数の解放
			next.reset ();
		}
	}


}	//namespace GAME

