//=================================================================================================
//
//	テスト
//
//=================================================================================================

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "Test_SoundFile.h"

//-------------------------------------------------------------------------------------------------
// 定義
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	Test::Test ()
	{
	}


	void Test::Load ()
	{
		s3d::Stopwatch sw;
		sw.start ();

		//G_Audio::Inst ()->HandLoad ();

		m_loadTime = sw.sF ();

		TASK_VEC::Load ();
	}

	void Test::Init ()
	{
		TASK_VEC::Init ();
	}

	void Test::Move ()
	{
		ClearPrint ();
		Print ( U"Audio Load Time: {}"_fmt ( m_loadTime ) );
		G_Audio::Inst ()->CheckAudio ();

		if ( ! m_start )
		{
			bool b = AUDIO()->IsStreamingBGM ( U"07_BGM_EIYUU.ogg" );
			if ( b )
			{
				AUDIO ()->PlayLoopBGM ( U"07_BGM_EIYUU.ogg" );
			}
			m_start = T;
		}

		TASK_VEC::Move ();
	}


}	//namespace GAME

