//=================================================================================================
//
//	テスト TestDrawArc
//
//=================================================================================================

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "TestDrawArc.h"

//-------------------------------------------------------------------------------------------------
// 定義
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	//Test
	Test::Test ()
	{
	}

	Test::~Test ()
	{
	}

	void Test::Load ()
	{
		m_prmCircle = std::make_shared < GamePrimitiveCircle > ();
		AddpTask ( m_prmCircle );
		GRPLST_INSERT ( m_prmCircle );

		TASK_VEC::Load ();
	}

	void Test::Draw ()
	{
		m_omega0 += 1.5;
		if ( m_omega0 >= 360 ) { m_omega0 = 0; }
		double theta0 = Math::ToRadians ( m_omega0 );

		m_omega1 += 1.2;
		if ( m_omega1 >= 360 ) { m_omega1 = 0; }
		double theta1 = Math::ToRadians ( m_omega1 );

		Circle { 400, 300, 100 }.drawArc (   0, theta0, 20, 10, ColorF {1.0, 0.5, 0.5}, ColorF {1.0, 1.0, 0.5} );
		Circle { 400, 300, 100 }.drawArc ( 100, theta1, 10, 20, ColorF {0.5, 0.5, 1.0}, ColorF {0.5, 1.0, 1.0, 0.5} );
	}



}	//namespace GAME

