//=================================================================================================
//
// StopWatch ソースファイル
//
//=================================================================================================

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "StopWatch.h"

//-------------------------------------------------------------------------------------------------
// 定義
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	StopWatch::StopWatch ()
	{
	}

	StopWatch::~StopWatch ()
	{
	}

	void StopWatch::Start ()
	{
		m_time.clear ();
		m_time.resize ( 10 );
		m_ave.clear ();
		m_ave.resize ( 10 );

		for ( int i = 0; i < 10; ++ i )
		{
			m_time [ i ] = 0;
			m_ave [ i ] = 0;
		}
	}

	void StopWatch::Disp ( DBGOUT_LINE index, LPCUSTR str )
	{
		//加算
		m_time [ index ] += m_sw.msF ();

		//平均
		if ( m_count >= 60 )
		{
			m_ave [ index ] = m_time[index] / 60.0;
		}

		//表示
		DBGOUT_WND_F ( index , U"{:2.4f}[ms] {}"_fmt( m_ave [ index ], str ) );

		//再スタート
		m_sw.restart ();
	}

	void StopWatch::Count ()
	{
		//カウント
		if ( m_count >= 60 )
		{
			m_count = 0;
			for ( int i = 0; i < 10; ++i )
			{
				m_time [ i ] = 0;
			}
		}
		++ m_count;
	}


}	//namespace GAME

