//=================================================================================================
//
//	ウィンドウズ ユーティリティ
//
//=================================================================================================

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "WND_UTL.h"

//-------------------------------------------------------------------------------------------------
// 定義
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	bool WND_UTL::AscKey ( int vKey )
	{
		//仮想キー "VK_**"

		//@info
		//関数の呼び出し時にキーが押されているかどうか、
		//および GetAsyncKeyState の前回の呼び出し後にキーが押されたかどうかを判別します。
		//
		//-> 同一フレームで２回以上判定すると２回め移行 False

		return ( ::GetAsyncKeyState ( vKey ) & 0x0001 );
	}

	void WND_UTL::MoveWindow_toCursor ()
	{
		//カーソル位置の取得
		POINT cursorPos;
		::GetCursorPos ( & cursorPos );
		cursorPos.x -= 400;
		cursorPos.y -= 15;
		s3d::Point pt { cursorPos.x, cursorPos.y };

		//ウィンドウの移動
		s3d::Window::SetPos ( pt );
	}

}	//namespace GAME

