//=================================================================================================
//
//	GameLib用共通機能
//
//=================================================================================================
#pragma once


//-------------------------------------------------------------------------------------------------
//	ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "Define.h"
#include "Define_Siv3D.h"
#include "GameLibConst.h"
#include "Format.h"
#include "DebugOutTrace.h"
#include "DebugOutPrint.h"
#include "STR_UTL.h"
#include "WND_UTL.h"
#include "Rect.h"
#include "HWnd.h"
#include "Archiver.h"


//-------------------------------------------------------------------------------------------------
// ライブラリファイルのリンク
//-------------------------------------------------------------------------------------------------
#if	_DEBUG
#pragma comment ( lib, "00_Common(debug).lib" )
#else
#pragma comment ( lib, "00_Common.lib" )
#endif	//_DEBUG

