//=================================================================================================
//
// ゲームグラフィック
//
//=================================================================================================
#pragma once


//-------------------------------------------------------------------------------------------------
//	ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "GameGraphicConst.h"
#include "GameGraphic.h"
#include "GamePrimitive.h"
#include "GameGrpStr.h"
#include "GameGraphicList.h"
//#include "ShaderList.h"
#include "GrpMovie.h"
#include "GrpShader.h"


//-------------------------------------------------------------------------------------------------
// ライブラリファイルのリンク
//-------------------------------------------------------------------------------------------------
#if	_DEBUG
#pragma comment ( lib, "02_GameGraphic(debug).lib" )
#else
#pragma comment ( lib, "02_GameGraphic.lib" )
#endif	//_DEBUG

