//=================================================================================================
//
// ゲームユーティリティ
//
//=================================================================================================
#pragma once


//-------------------------------------------------------------------------------------------------
//	ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "DebugOutGameWindow.h"
#include "GameSystem.h"
#include "Timer.h"
#include "GameMainBase.h"
#include "GrpDemo.h"
#include "GrpEf.h"
#include "FadeRect.h"
#include "GrpBlink.h"
#include "Menu.h"
#include "AppSettingFile.h"


//-------------------------------------------------------------------------------------------------
// ライブラリファイルのリンク
//-------------------------------------------------------------------------------------------------
#if	_DEBUG
#pragma comment ( lib, "10_GameUtility_debug.lib" )
#else
#pragma comment ( lib, "10_GameUtility.lib" )
#endif	//_DEBUG

