//=================================================================================================
//
// ゲームグラフィック　クラス　ヘッダ
//		グラフィックを扱うオブジェクトを定義する
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダファイル　インクルード
//-------------------------------------------------------------------------------------------------
#include "Siv3D.hpp"
#include "GameTask.h"


//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	//■=======================================================================
	// ゲームグラフィック　ベース
	//		・複数テクスチャと複数オブジェクトを持つグラフィックスプライト
	//		・テクスチャが指定されていないときは何もしない
	//		・純粋仮想関数を持つので実体化は不可
	//		・継承先
	//			GameGraphicFromFile
	//			GameGraphicFromArchive
	//			GameGraphicApprovedTexture
	//		　のいずれかを用いる
	//		・オブジェクトは自動で１つ生成する。複数追加する場合はクリアしてから追加する
	//■=======================================================================
	class GameGraphicBase : public GameTask 
	{
		//テクスチャ配列(インデックスはオブジェクトが持つ)
		
		s3d::String	m_filename { U"" };
		std::shared_ptr < s3d::Texture >	m_tx { nullptr };

	public:
		GameGraphicBase ();
		GameGraphicBase ( const GameGraphicBase & rhs ) = delete;
		~GameGraphicBase ();

		void SetTextureName ( s3d::String filename ) { m_filename = filename; }

		void Load ();
		void Draw ();
 	};

	using GrpBs = GameGraphicBase;
	using P_Grp = std::shared_ptr < GrpBs >;


}	//namespace GAME

