//=================================================================================================
//
// ゲーム グラフィック　ストリング
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダファイル　インクルード
//-------------------------------------------------------------------------------------------------
#include "Define_Siv3D.h"
#include "GameGraphicCore.h"


//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	//=======================================================================
	//	Rect 
	//=======================================================================
	class GameGraphicString : public GameGraphicCore
	{
		s3d::Font	m_font { 20 };
		bool		m_valid { T };
		VEC2		m_pos { 0, 0 };		//基準位置
		s3d::String m_str { U"GrpStr" };		

	public:
		GameGraphicString ();
		GameGraphicString ( const GameGraphicString & rhs ) = delete;
		~GameGraphicString ();

		void Draw ();

		void SetPos ( VEC2 v );
		void SetStr ( s3d::String str );
	};

	using GrpStr = GameGraphicString;
	using P_GrpStr = std::shared_ptr < GrpStr >;



}	//namespace GAME

