//=================================================================================================
//
// ゲームシステム　ヘッダ
//		ゲーム内容の前に必要になるアプリケーションやライブラリとの連動を記述する。
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
//	ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "00_Common.h"
#include "GameMainBase.h"


//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME
{

	//-------------------------------------------------------------------------------------------------
	//	ゲーム内のライブラリ使用など
	//-------------------------------------------------------------------------------------------------
	class GameSystem
	{
		UP_GameMainBase		m_pGameMain;

	public:
		GameSystem () {}
		GameSystem ( const GameSystem& rhs ) = delete;
		~GameSystem () {}

		void SystemLoad ();		//シングルトンのクリエイトなど初期化

		void Move ();
		void Draw ();

		//メインオブジェクトの設定
		void SetpGameMain ( UP_GameMainBase pGameMain );

	private:
		static bool m_bMakeArchive;		//アーカイブ作成フラグ

	public:
		//-----------------------------
		//	static 環境設定
		//-----------------------------

		//デバッグ表示をすべてON
		//		static void FullDebugMode () { m_bDispTimer = T; }

		//デバッグ表示をすべてON
		//		static void NoDebugMode () { m_bDispTimer = F; }

		//アーカイブを作成して読み込み
		static void SetFlag_MakeArchive ( bool b ) { m_bMakeArchive = b; }
	};

}

