//=================================================================================================
//
// ゲームグラフィック　シェーダ利用　ヘッダ
//		シェーダを利用するグラフィックを定義する
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダファイル　インクルード
//-------------------------------------------------------------------------------------------------
#include "00_Common.h"
#include "GameGraphic.h"


//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME
{

	//@info GameGraphicBaseに統合

#if 0
	class GrpShader : public GameGraphicBase
	{
	public:
		GrpShader ();
		GrpShader ( const GrpShader & rhs ) = delete;
		~GrpShader ();

		void Draw ();
	};

	using GrpShd = GrpShader;
	using P_GrpShd = std::shared_ptr < GrpShd >;
#endif // 0


}	//namespace GAME

