//=================================================================================================
//
//	Sivキーボード
//		入力記録を毎フレームで記録し、押されている状態かどうかを取得する
//		キー定数はKeyDefine.hにて定義
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "Define.h"
#include "SivKeyboardDefine.h"

//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	class SivKeyboard
	{
		//キーボードの状態保存
		s3d::Array < bool >	ma_keyState {};
		s3d::Array < bool >	ma_preKeyState {};

	public:
		SivKeyboard ();
		SivKeyboard ( const SivKeyboard & rhs ) = delete;
		~SivKeyboard ();

		//指定したキーが押されているか
		bool IsKey( KEY_NAME nKey );
		//指定したキーが押された瞬間か
		bool PushKey( KEY_NAME nKey );
		//指定したキーが離された瞬間か
		bool ReleaseKey( KEY_NAME nKey );

		//ゲーム利用
		//状態の更新
		//メインオブジェクトから取得
		void Update ( const Array < s3d::Input > & keys );

		//キー設定用
		//いずれかの押された瞬間のキーを返す
		KEY_NAME WhichInput ();
	};
}
