//=================================================================================================
//
//	ウィンドウズ ユーティリティ
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダファイル　インクルード
//-------------------------------------------------------------------------------------------------
#include "Define.h"


//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	class WND_UTL final
	{
	public:
		WND_UTL () = delete;	//staticクラスとして実体化禁止
		~WND_UTL () = delete;

		//キーボードの押した状態かどうか
		//仮想キー "VK_**" ( < WinUser.h > )
		static bool AscKey ( int vKey );

		//カーソル位置にウィンドウを移動
		static void MoveWindow_toCursor ();

		//カーソル位置があるモニタの中心に移動
		static void MoveWindow_toCenter_onCursor ( int32 width, int32 height );
	};


}	//namespace GAME

